package com.ljc.socialdemo.db;

import java.util.List;

import com.ljc.socialdemo.db.dao.Message;

import java.util.ArrayList;

/**
 * Created by 18075 on 2018/11/9.
 */

public class TestDao {


    public static List<Message> getMessageList() {
        List list = new ArrayList();
        list.add(new Message(null,"", "LOL：绝望S9？faker合同即将到期！中国网友：等一个edg.faker！", "[链接]LOL：绝望S9？faker合同即将到期！中国网友：等一个edg.faker！", "2018-11-9"));
        list.add(new Message(null,"", "澳洲大学3辆豪车照片引网友疯狂吐槽：肯定又是中国学生炫富！", "[链接]澳洲大学3辆豪车照片引网友疯狂吐槽：肯定又是中国学生炫富！", "2018-11-9"));
        list.add(new Message(null,"", "为了这事，中央政法委机关首次“比武”", "[链接]为了这事，中央政法委机关首次“比武”", "2018-11-9"));
        list.add(new Message(null,"", "5G资费到底怎么收？运营商的这个回答你满意吗？", "[链接]5G资费到底怎么收？运营商的这个回答你满意吗？", "2018-11-9"));
        list.add(new Message(null,"", "暴雪蓝色预警：黑龙江吉林新疆局地有大暴雪 局地新增积雪将超10厘米", "[链接]暴雪蓝色预警：黑龙江吉林新疆局地有大暴雪 局地新增积雪将超10厘米", "2018-11-9"));
        list.add(new Message(null,"", "暴雪最狼狈的一次！股价一夜蒸发208亿，只因和中国合作款手游？", "[链接]暴雪最狼狈的一次！股价一夜蒸发208亿，只因和中国合作款手游？", "2018-11-9"));
        list.add(new Message(null,"", "父子拔枪互射致儿死 法院：死者违人伦 其父获轻判", "[链接]父子拔枪互射致儿死 法院：死者违人伦 其父获轻判Z", "2018-11-9"));
        list.add(new Message(null,"", "司法鉴定“黄牛”套路：虚假加一个伤残等级，可多得13.6万元赔付", "[链接]司法鉴定“黄牛”套路：虚假加一个伤残等级，可多得13.6万元赔付", "2018-11-9"));
        list.add(new Message(null,"", "杭州公交车上一张纸条火了！只有一个字，暖到了无数人", "[链接]杭州公交车上一张纸条火了！只有一个字，暖到了无数人", "2018-11-9"));
        list.add(new Message(null,"", "泉州通报碳九泄漏：安全生产责任事故引发的环境污染事件", "[链接]泉州通报碳九泄漏：安全生产责任事故引发的环境污染事件", "2018-11-9"));
        list.add(new Message(null,"", "贾跃亭用乐视网股份还债持股下降；快递员平均工资超7000,上海最高", "[链接]贾跃亭用乐视网股份还债持股下降；快递员平均工资超7000,上海最高", "2018-11-9"));
        list.add(new Message(null,"", "中国未来真正的30个商业模式", "[链接]中国未来真正的30个商业模式", "2018-11-9"));
        list.add(new Message(null,"", "快播王欣出狱后二次创业，又一款视频软件面世，网友们非常激动", "快播王欣出狱后二次创业，又一款视频软件面世，网友们非常激动", "2018-11-9"));
        list.add(new Message(null,"", "华为、腾讯、阿里、网易员工下班时间曝光！靠加班，你赢不了他们", "[链接]华为、腾讯、阿里、网易员工下班时间曝光！靠加班，你赢不了他们", "2018-11-9"));
        list.add(new Message(null,"", "24岁身家2800亿，富过马云，这个网瘾少年怎么做到的？", "[链接]24岁身家2800亿，富过马云，这个网瘾少年怎么做到的？", "2018-11-9"));
        list.add(new Message(null,"", "“能不能现在就接走！”最近朋友圈，未来亲家都在相互甩锅", "[链接]“能不能现在就接走！”最近朋友圈，未来亲家都在相互甩锅", "2018-11-9"));
        list.add(new Message(null,"", "川影“女生入男寝”事件续：校方将追责宿管员，加强作风教育", "[链接]川影“女生入男寝”事件续：校方将追责宿管员，加强作风教育", "2018-11-9"));
        list.add(new Message(null,"", "被导演骗来的主角们，有的拍完后悔不已，有的一举成名", "[链接]被导演骗来的主角们，有的拍完后悔不已，有的一举成名", "2018-11-9"));
        list.add(new Message(null,"", "LOL：IG夺冠王校长放出豪言“只能涨工资”！网友：财大气粗WXZ", "[链接]LOL：IG夺冠王校长放出豪言“只能涨工资”！网友：财大气粗WXZ", "2018-11-9"));
        list.add(new Message(null,"", "SKT拥有VN冠军皮肤，三星有霞的冠军皮肤，IG有卡莎的冠军皮肤，你觉得Uzi是不是被针对很惨？", "[链接]SKT拥有VN冠军皮肤，三星有霞的冠军皮肤，IG有卡莎的冠军皮肤，你觉得Uzi是不是被针对很惨？", "2018-11-9"));
        list.add(new Message(null,"", "浙大上微博热搜！大学生耍“官威”、爆粗口惹众怒！校方：已道歉", "[链接]浙大上微博热搜！大学生耍“官威”、爆粗口惹众怒！校方：已道歉", "2018-11-9"));
        list.add(new Message(null,"", "河工大大三学生实习每天干11小时，不干不发毕业证？", "[链接]河工大大三学生实习每天干11小时，不干不发毕业证？", "2018-11-9"));
        list.add(new Message(null,"", "滴滴整改，坐车有新变化！网友评论炸了……", "[链接]滴滴整改，坐车有新变化！网友评论炸了……", "2018-11-9"));
        list.add(new Message(null,"", "上大学和不上大学打工有什么区别？", "[链接]上大学和不上大学打工有什么区别？", "2018-11-9"));
        list.add(new Message(null,"", "34岁博士生8年送出80万件快递，老师怒了：脑子有病？", "[链接]34岁博士生8年送出80万件快递，老师怒了：脑子有病？", "2018-11-9"));
        list.add(new Message(null,"", "“00”后入伍前后对比照，这简直赤裸裸的“整形”啊！", "[链接]“00”后入伍前后对比照，这简直赤裸裸的“整形”啊！", "2018-11-9"));
        list.add(new Message(null,"", "小学生作文《可怜啊》走红，哀叹每天才5毛零花钱", "[链接]小学生作文《可怜啊》走红，哀叹每天才5毛零花钱", "2018-11-9"));
        list.add(new Message(null,"", "万达电影4跌停王健林身家缩水100亿 “公子哥”7年磨一剑财富增值12倍", "[链接]万达电影4跌停王健林身家缩水100亿 “公子哥”7年磨一剑财富增值12倍", "2018-11-9"));
        list.add(new Message(null,"", "海南两棵枯树竟卖了1400多万，大妈懊恼：过去当柴火烧了好多", "[链接]海南两棵枯树竟卖了1400多万，大妈懊恼：过去当柴火烧了好多", "2018-11-9"));
        list.add(new Message(null,"", "新疆玛纳斯盐湖：“盐花”绽放似“冰花”", "[链接]新疆玛纳斯盐湖：“盐花”绽放似“冰花”", "2018-11-9"));
        list.add(new Message(null,"", "清华领跑2018毕业生薪酬榜：“你985毕业了不起？”“是的”", "[链接]清华领跑2018毕业生薪酬榜：“你985毕业了不起？”“是的”", "2018-11-9"));
        list.add(new Message(null,"", "贵州一男子浑身血迹，走在高速上，交警询问得知：他杀了女友后……", "[链接]贵州一男子浑身血迹，走在高速上，交警询问得知：他杀了女友后……", "2018-11-9"));
        list.add(new Message(null,"", "淘宝上有哪些商品能让你感叹：\"啊，万能的淘宝！\"？", "[链接]淘宝上有哪些商品能让你感叹：\"啊，万能的淘宝！\"？", "2018-11-9"));
        list.add(new Message(null,"", "胡歌刘亦菲《仙剑奇侠传》确认翻拍：胜败乃兵家常事，大侠还能重新来过吗？", "[链接]胡歌刘亦菲《仙剑奇侠传》确认翻拍：胜败乃兵家常事，大侠还能重新来过吗？", "2018-11-9"));
        list.add(new Message(null,"", "笑哭！沈腾真的是接包袱小能手！最后一个绝了", "[链接]笑哭！沈腾真的是接包袱小能手！最后一个绝了", "2018-11-9"));
        list.add(new Message(null,"", "王思聪微博抽奖收获顶级流量，破微博记录", "[链接]王思聪微博抽奖收获顶级流量，破微博记录", "2018-11-9"));
        list.add(new Message(null,"", "天猫双11支付宝帮你还花呗：最高49999元，祝你成为下一个信小呆", "[链接]天猫双11支付宝帮你还花呗：最高49999元，祝你成为下一个信小呆", "2018-11-9"));
        list.add(new Message(null,"", "暴雪蓝色预警！“超凶”冷空气变身温带气旋，携大暴雪袭击黑龙江", "[链接]暴雪蓝色预警！“超凶”冷空气变身温带气旋，携大暴雪袭击黑龙江", "2018-11-9"));
        list.add(new Message(null,"", "抖音“邋遢母女”爆红，一夜吸粉500万，化了妆竟意外的好看！", "[链接]抖音“邋遢母女”爆红，一夜吸粉500万，化了妆竟意外的好看！", "2018-11-9"));
        list.add(new Message(null,"", "张一山出演《鹿鼎记》压力巨大，这个老婆背景太大，网友：惹不起", "[链接]张一山出演《鹿鼎记》压力巨大，这个老婆背景太大，网友：惹不起Z", "2018-11-9"));
        list.add(new Message(null,"", "让沈腾吓到腿软的10个亿，原来去掉特效后，我竟离10亿这么近", "[链接]让沈腾吓到腿软的10个亿，原来去掉特效后，我竟离10亿这么近", "2018-11-9"));
        list.add(new Message(null,"", "孙红雷新剧来了，一次来两部！分别合作两位美女，辛芷蕾还有万茜", "[链接]孙红雷新剧来了，一次来两部！分别合作两位美女，辛芷蕾还有万茜", "2018-11-9"));
        list.add(new Message(null,"", "泰森出一千万招婿，看到大女儿的颜值后，网友：一个亿也不去！", "[链接]泰森出一千万招婿，看到大女儿的颜值后，网友：一个亿也不去！", "2018-11-9"));
        list.add(new Message(null,"", "六小龄童发布孙悟空手办，12000元起价，网友：求你放过西游记！", "[链接]六小龄童发布孙悟空手办，12000元起价，网友：求你放过西游记！", "2018-11-9"));
        list.add(new Message(null,"", "古天乐开直播紧张，网友：是不是盖学校缺钱了？我给你刷袋水泥！", "[链接]古天乐开直播紧张，网友：是不是盖学校缺钱了？我给你刷袋水泥！", "2018-11-9"));
        list.add(new Message(null,"", "唐嫣罗晋结个婚是怎么做到被吐槽的？", "[链接]唐嫣罗晋结个婚是怎么做到被吐槽的？", "2018-11-9"));
        list.add(new Message(null,"", "我说一句台词，你可千万别哭啊", "[链接]我说一句台词，你可千万别哭啊", "2018-11-9"));
        list.add(new Message(null,"", "人民大会堂成“照妖镜”，明星素颜出席，看到胡歌忍不住笑出声！", "[链接]人民大会堂成“照妖镜”，明星素颜出席，看到胡歌忍不住笑出声！", "2018-11-9"));
        list.add(new Message(null,"", "买了佛冷什么意思？买了佛冷什么梗？终于知道是怎么来的了！", "[链接]买了佛冷什么意思？买了佛冷什么梗？终于知道是怎么来的了！", "2018-11-9"));
        list.add(new Message(null,"", "“网红吃播”骗局，龙虾假的，火锅底料是蛋糕，网友：差点就信了", "[链接]“网红吃播”骗局，龙虾假的，火锅底料是蛋糕，网友：差点就信了", "2018-11-9"));
        list.add(new Message(null,"", "“王校长”为什么迷上陈雅婷，看到全身照后，网友：还是有道理的", "[链接]“王校长”为什么迷上陈雅婷，看到全身照后，网友：还是有道理的", "2018-11-9"));
        list.add(new Message(null,"", "有一种aj叫赵本山的aj，现在“烂大街”，而他21年前就在穿", "[链接]有一种aj叫赵本山的aj，现在“烂大街”，而他21年前就在穿", "2018-11-9"));
        list.add(new Message(null,"", "王思聪吃热狗又被盯上，被冰雕师傅玩坏了，网友：这家餐厅有胆量", "[链接]王思聪吃热狗又被盯上，被冰雕师傅玩坏了，网友：这家餐厅有胆量", "2018-11-9"));
        list.add(new Message(null,"", "吴佩慈、大小S的命运，早就写在14年前的《康熙》里", "[链接]吴佩慈、大小S的命运，早就写在14年前的《康熙》里", "2018-11-9"));
        list.add(new Message(null,"", "清朝最后一位大内高手，武功强到什么地步？原来真的有高手存在", "[链接]清朝最后一位大内高手，武功强到什么地步？原来真的有高手存在", "2018-11-9"));
        list.add(new Message(null,"", "王思聪给吴亦凡宣传新歌，评论区全是亮点，太有才了", "[链接]王思聪给吴亦凡宣传新歌，评论区全是亮点，太有才了", "2018-11-9"));
        list.add(new Message(null,"", "邓家佳火锅店突然爆红的背后 网友：良心火锅！", "[链接]邓家佳火锅店突然爆红的背后 网友：良心火锅！", "2018-11-9"));
        list.add(new Message(null,"", "张馨予军人老公被吐槽假期太多，她回怼传言：7年一共休了50天假", "[链接]张馨予军人老公被吐槽假期太多，她回怼传言：7年一共休了50天假", "2018-11-9"));
        list.add(new Message(null,"", "王可可在王思聪心里是什么地位？", "[链接]王可可在王思聪心里是什么地位？", "2018-11-9"));
        list.add(new Message(null,"", "这是你们心目中的邓超吗？……不说了，让我歇一会儿，肚子笑痛了", "[链接]这是你们心目中的邓超吗？……不说了，让我歇一会儿，肚子笑痛了", "2018-11-9"));
        list.add(new Message(null,"", "时隔十个月，贾乃亮终于走出了李小璐Pgone风波，这次他真的皮了Z", "[链接]时隔十个月，贾乃亮终于走出了李小璐Pgone风波，这次他真的皮了", "2018-11-9"));
        list.add(new Message(null,"", "明星最美的部位，郑爽漫画腿，赵丽颖蚂蚁腰，胡歌的够我笑一天", "[链接]明星最美的部位，郑爽漫画腿，赵丽颖蚂蚁腰，胡歌的够我笑一天", "2018-11-9"));
        list.add(new Message(null,"", "这7个一线明星，承包了半个娱乐圈的笑点，原来都是东北人", "[链接]这7个一线明星，承包了半个娱乐圈的笑点，原来都是东北人", "2018-11-9"));
        list.add(new Message(null,"", "大婚后首谈丈夫罗晋，唐嫣害羞自述最难忘的瞬间", "[链接]大婚后首谈丈夫罗晋，唐嫣害羞自述最难忘的瞬间", "2018-11-9"));
        list.add(new Message(null,"", "小沈阳送谢娜两盒“五常大米”以为很抠门，知道后表示吃不起", "[链接]小沈阳送谢娜两盒“五常大米”以为很抠门，知道后表示吃不起", "2018-11-9"));
        list.add(new Message(null,"", "王思聪为什么老是跟杨超越过不去，网友：如果这都不算爱！", "[链接]王思聪为什么老是跟杨超越过不去，网友：如果这都不算爱！", "2018-11-9"));
        list.add(new Message(null,"", "曾是奥运冠军，却爱上教练14岁女儿，苦等7年最终成功抱得美人归", "[链接]曾是奥运冠军，却爱上教练14岁女儿，苦等7年最终成功抱得美人归", "2018-11-9"));
        list.add(new Message(null,"", "韩红怒斥山寨林俊杰，假明星也能年入百万", "[链接]韩红怒斥山寨林俊杰，假明星也能年入百万", "2018-11-9"));
        list.add(new Message(null,"", "粉丝破千万的抖音红人“面筋哥”，感谢当初韩红当场让他滚！", "[链接]粉丝破千万的抖音红人“面筋哥”，感谢当初韩红当场让他滚！", "2018-11-9"));
        list.add(new Message(null,"", "刘恺威回应离婚风波，你怎么看？", "[链接]刘恺威回应离婚风波，你怎么看？", "2018-11-9"));
        list.add(new Message(null,"", "王思聪被问为什么要买这么多豪车？他机智回答，主持人心服口服！", "[链接]王思聪被问为什么要买这么多豪车？他机智回答，主持人心服口服！", "2018-11-9"));
        list.add(new Message(null,"", "张钧甯用力过猛！谁注意她脖子上的印记？打脸半个娱乐圈", "[链接]张钧甯用力过猛！谁注意她脖子上的印记？打脸半个娱乐圈", "2018-11-9"));
        list.add(new Message(null,"", "7次拒绝导演“潜规则”后竟遭“封杀”，胡歌竟也递过“奏折”？", "[链接]7次拒绝导演“潜规则”后竟遭“封杀”，胡歌竟也递过“奏折”？", "2018-11-9"));
        list.add(new Message(null,"", "范冰冰发博安慰粉丝，评论区炸了！网友：你误会我们的意思了", "[链接]范冰冰发博安慰粉丝，评论区炸了！网友：你误会我们的意思了", "2018-11-9"));
        list.add(new Message(null,"", "《仙剑奇侠传一》确定翻拍！男主确定惹争议，网友：魔爪伸过来了", "[链接]《仙剑奇侠传一》确定翻拍！男主确定惹争议，网友：魔爪伸过来了", "2018-11-9"));
        list.add(new Message(null,"", "为什么王思聪一条微博比赵丽颖、唐嫣结婚微博的转发量还多？", "[链接]为什么王思聪一条微博比赵丽颖、唐嫣结婚微博的转发量还多？", "2018-11-9"));
        list.add(new Message(null,"", "40岁的陈乔恩终于迎来自己的爱情，网友：虽然不是他，但是还祝福", "[链接]40岁的陈乔恩终于迎来自己的爱情，网友：虽然不是他，但是还祝福", "2018-11-9"));
        list.add(new Message(null,"", "黄磊女儿一年学费13万，沙溢儿子25万，而他让孩子上普通学校", "[链接]黄磊女儿一年学费13万，沙溢儿子25万，而他让孩子上普通学校", "2018-11-9"));
        list.add(new Message(null,"", "没有杨幂的气场就不要扎脏辫了，关晓彤辣眼睛，欧阳娜娜竟然垫底", "[链接]没有杨幂的气场就不要扎脏辫了，关晓彤辣眼睛，欧阳娜娜竟然垫底", "2018-11-9"));
        list.add(new Message(null,"", "曾志伟蓝洁瑛事件余波再起：又一位巨星被拉下水！", "[链接]曾志伟蓝洁瑛事件余波再起：又一位巨星被拉下水！", "2018-11-9"));
        list.add(new Message(null,"", "温婉直播突然卸妆吓人，素颜再次惊到网友，牙真的显眼！", "[链接]温婉直播突然卸妆吓人，素颜再次惊到网友，牙真的显眼！", "2018-11-9"));
        list.add(new Message(null,"", "被哈登称为中国女神！嫁老富豪后闪离婚，如今单身想找中国男人！", "[链接]被哈登称为中国女神！嫁老富豪后闪离婚，如今单身想找中国男人！", "2018-11-9"));
        list.add(new Message(null,"", "5分钟读懂10个小故事，开拓你的金融思维！", "[链接]5分钟读懂10个小故事，开拓你的金融思维！", "2018-11-9"));
        list.add(new Message(null,"", "从零开始做电商，你确定搞懂行情了？", "[链接]从零开始做电商，你确定搞懂行情了？", "2018-11-9"));
        list.add(new Message(null,"", "在马云借呗上借了1万元放入余额宝，每月能赚多少钱？", "[链接]在马云借呗上借了1万元放入余额宝，每月能赚多少钱？", "2018-11-9"));
        list.add(new Message(null,"", "90后大学生楷模！24岁5次创业，让跟他混的合伙人日赚斗金？", "[链接]90后大学生楷模！24岁5次创业，让跟他混的合伙人日赚斗金？", "2018-11-9"));
        list.add(new Message(null,"", "李克强:群策群力应变克难保持经济平稳运行和健康发展", "[链接]李克强:群策群力应变克难保持经济平稳运行和健康发展", "2018-11-9"));
        list.add(new Message(null,"", "西藏措勤县磁石乡党委书记李志龙做实事敢担当", "[链接]西藏措勤县磁石乡党委书记李志龙做实事敢担当", "2018-11-9"));
        list.add(new Message(null,"", "《关于征集网络社会组织党建工作优秀案例的通知》", "[链接]《关于征集网络社会组织党建工作优秀案例的通知》", "2018-11-9"));
        list.add(new Message(null,"", "[吃下定心丸 安心谋发展]史贵禄:成功得益于改革开放", "[链接][吃下定心丸 安心谋发展]史贵禄:成功得益于改革开放", "2018-11-9"));
        list.add(new Message(null,"", "进博会：推进经济全球化的公共产品", "[链接]进博会：推进经济全球化的公共产品", "2018-11-9"));
        list.add(new Message(null,"", "统计局：2018年10月份CPI、PPI环比涨幅均回落", "[链接]统计局：2018年10月份CPI、PPI环比涨幅均回落", "2018-11-9"));
        list.add(new Message(null,"", "透视“世界互联网大会蓝皮书”：各国发展、应用互联网能力全面提升", "[链接]透视“世界互联网大会蓝皮书”：各国发展、应用互联网能力全面提升", "2018-11-9"));
        list.add(new Message(null,"", "两部门解读《农业农村污染治理攻坚战行动计划》", "[链接]两部门解读《农业农村污染治理攻坚战行动计划》", "2018-11-9"));
        list.add(new Message(null,"", "航行空间广阔、保护系统完备 飞机相撞的元凶是谁？", "[链接]航行空间广阔、保护系统完备 飞机相撞的元凶是谁？", "2018-11-9"));
        list.add(new Message(null,"", "行业专家：5G资费还待科学设计 民众尚需理智期待", "[链接]行业专家：5G资费还待科学设计 民众尚需理智期待", "2018-11-9"));
        list.add(new Message(null,"", "中国旅游辉煌40年：未来科技将赋予旅游无限可能", "[链接]中国旅游辉煌40年：未来科技将赋予旅游无限可能", "2018-11-9"));
        list.add(new Message(null,"", "统计局：10月份工业生产者出厂价格同比上涨3.3%", "[链接]统计局：10月份工业生产者出厂价格同比上涨3.3%", "2018-11-9"));
        list.add(new Message(null,"", "河南姑娘捐“生命种子”救高考状元 获手书作品感恩", "[链接]河南姑娘捐“生命种子”救高考状元 获手书作品感恩", "2018-11-9"));
        list.add(new Message(null,"", "20岁少女爱上72岁大爷，坚持与其结婚，婚后住进私人岛屿", "[链接]20岁少女爱上72岁大爷，坚持与其结婚，婚后住进私人岛屿", "2018-11-9"));
        list.add(new Message(null,"", "拾荒老汉捡到一麻袋钞票, 扛起来就去了派出所, 打开检查后都懵了", "[链接]拾荒老汉捡到一麻袋钞票, 扛起来就去了派出所, 打开检查后都懵了", "2018-11-9"));
        return list;
    }
}
